<div class="container">
  <div class="row">
<div class="UL">
                                            <h2>Юля</h2>
     <b>Сайт</b> –<u>это информационная единица в интернете</u>, ресурс из веб-страниц (документов), которые объединены общей темой и связаны между друг с другом с помощью ссылок. Он зарегистрирован на одно юридическое или физическое лицо и обязательно привязан к конкретному домену, являющемуся его адресом. Сайт может состоять как из одной страницы, так и огромного количества. Каждая страница ресурса – это текстовый файл или их набор, написанный на специальном языке разметки или программирования (HTML, PHP, CSS и пр.). После загрузки на компьютер файлы этого формата обрабатываются в браузере. В конечном итоге пользователь видит загруженную страницу сайта. 
      <p><b>Виды сайтов</b></p>
      Создание всех ресурсов направлено на достижение какой-либо определенной цели. Сайты бывают <u>коммерческими</u>, <u>некоммерческими</u> и <u>информационными</u>. 
      <p><b>Некоммерческие.</b></p>
      <br>В эту группу входят социальные и правительственные ресурсы, площадки учебных учреждений или определенных лиц. Как правило, главная цель создания таких ресурсов – своевременно донести информацию до населения. <br>Второстепенная – получение обратной связи.
      <p><b>Коммерческие.</b></p> Это веб-ресурсы компаний, созданные с целью увеличения клиентской базы, повышения продаж (некоторые организации специально создают площадки для оказания своих услуг или продажи товаров онлайн). Это промосайты, интернет-магазины, сайты-витрины, визитки и пр.
      <p><b>Информационные.</b></p> Это проекты, созданные для предоставления пользователям интересующей их информации. Как правило, это новостные сайты, блоги, тематические ресурсы. Для них характерна широкая целевая аудитория, доступная пользователям и максимально полная информация.
      <strong>Кто участвует в разработке сайта</strong>
      Сайт в интернете напоминает пазл. В его создании принимает участие множество специалистов. Его собирают <b>верстальщики, программисты, интернет-маркетологи, дизайнеры</b>.
      <p><b>Веб-дизайнер.</b></p> В первую очередь этот специалист <u>разрабатывает дизайн будущего ресурса</u>. Кроме желаний заказчика, он должен учитывать цель создания сайта, его аудиторию. Также специалист выполняет подбор подходящих шрифтов, определяет расположение изображений, видео и других медиафайлов. Таким образом создается макет.
      <p><b>Верстальщик.</b></p> Затем начинается работа верстальщика. С учетом уже готового дизайн-проекта он должен «подстроить» будущий ресурс под разные браузеры. Этот называется верстка макета.
      Программист. После этого программист занимается формированием структуры сайта и созданием системы управления проектом. Информация добавляется на ресурс только по окончании всех работ.
      <q>Иные специалисты. Также в разработке ресурса принимает участие команда специалистов, которая занимается его раскруткой и усовершенствованием деятельности. В этом процессе может принимать участие как один человек, так и команда, состоящая из веб-аналитиков, копирайтеров, маркетологов и пр.</q>
    </div> 
    <div class="SS1">
                                                    <h2>Сергей1</h2>
      <strong>Из чего состоит сайт</strong>
      <br><b>Доменное имя</b> – <u>адрес веб-сайта, например seonews.ru.</u> В данном случае это то, что отделено точкой от домена ru. Также существуют домены третьего, четвертого и других уровней. Для SEO наиболее эффективным считается доменное имя второго уровня.

     <br><b> Сервер, или хостинг,</b> – <u>место, где размещены файлы вашего ресурса.</u> Они хранятся не в облаках, а находятся физически на каком-либо устройстве, на котором предоставляет место хостинг.

     <br><b> СMS</b> – <u>система управления большинством современных web-сайтов, их движок.</u> Предназначен для удобства использования ресурса. Наиболее популярны WordPress, OpenCart, PrestaShop, Drupal, Joomla и др. Все их файлы находятся на конкретном сервере. Также там хранятся и файлы сайта – база данных, различные картинки, видео.

      <br><b>content</b> – <u>содержимое веб-ресурса,</u> то есть текст, изображения, видео, анимация и другие файлы. Оптимизация контента – важный этап продвижения сайта в Сети.
      Из чего состоит сайт, или основные структурные блоки сайта
      <br><b>Шапка или header.</b>Располагается всегда в самом верху страницы. <u>Обычно в этом блоке размещается название сайта, или же, например, компании.</u> В шапке могут разместить логотип (если он есть) и основное меню сайта.

      <br><b>Подвал или footer</b>- <u>Это завершающий блок, который всегда располагается в самом низу страницы.</u> Непременное место для информации о копирайте сайта. Здесь частенько размещают контактные данные для связи, что вполне удобно, т. к. футер на всех страницах сайта обычно одинаковый, да и контактную информацию долго искать не надо — всегда на глазах. Иногда в этом блоке дублируют часть основного меню сайта, чтобы не перелистывать страницу на самый верх (для удобства).

      <br><b>Сайдбар</b> — очень удобное место для <u>второго меню на сайте.</u> Он бывает левый и правый. Основное — в шапке, а здесь — вспомогательное. Например, на информационных сайтах в сайдбаре размещают меню рубрик или содержание текущей статьи. Иногда сайдбар «прилепляют» на экране, и при прокрутке он всегда остается доступным, позволяя осуществлять более быструю и удобную навигацию.

    </div>
    <div class="tmk">
                                                          <h2>ТОМИОКА</h2>
      <br><b>HTML</b> - <u>это код, который используется для структурирования и отображения веб-страницы и её контента.</u> Например, контент может быть структурирован внутри множества параграфов, маркированных списков или с использованием изображений и таблиц данных. Но прежде всего <double>HTML - это система верстки, которая определяет, как и какие элементы должны располагаться на веб-странице.</double> Информация на сайте, способ её представления и оформления зависят исключительно от разработчика и тех целей, которые он перед собой ставит.

      Когда вы заходите на сайт, браузер подгружает НТМL-файл с информацией о структуре и контенте веб-страницы.<u> HTML как бы выстраивает визуальный фундамент сайта,</u> но не «запускает» сайт самостоятельно. Он всего лишь указывает, где располагаются элементы, какой у них будет базовый дизайн, откуда брать стили для элементов и скрипты.
      <p><b>Основные элементы НТМL</b></p>

      Раскрыть, что такое язык разметки HTML можно, представив его в качестве инструмента для преобразования простых команд (тегов), в визуальные объекты. К примеру, тег <img> применяется для вывода в браузере картинок. <u>Обязательным атрибутом выступает ссылка на файл.</u> Как правило, для хранения картинок используются ресурсы удаленного сервера, где расположены все файлы сайта, или специальные внешние сервисы.

      <p><b>Основные группы элементов HTML используются для решения следующих задач:</b></p>
      <br><b>Текстовое форматирование</b> - <b>жирный шрифт</b>, <em>курсив,</em> <u>подчеркивание</u>, размер кегля, списки (нумерованные или маркированные).

      <br><b>Текстовые блоки</b> - <u>разные уровни заголовков</u> от н1 до н6, абзацы, написание с новой строки

      <br><b>Табличные формы</b> - неограниченное число строчек, столбцов, указание до фиксированных параметров высоты/ширины, заголовки.

      Вставка картинок, аудио, текстовых и видеофайлов.

      <b>Гиперссылки</b>, <u>обеспечивающие переход на файл картинки,</u> прайса и на отдельную страницу с определенного пункта меню или анкора в тексте.

      Кроме того, существуют атрибуты, обеспечивающие открытия документа в текущем/новом окне. В языке HTML есть возможность для разработки простых форм для ввода текста, выбора пункта из списка.
      Если что-то не так, скажите, я подправлю

    </div>
    <div class="SS2">
                                                      <H2>Серге2</H2>
      <br><b>Open Server Panel</b> — <u>это портативная программная среда,</u> созданная специально для веб-разработчиков с учётом их рекомендаций и пожеланий.

      Данный программный комплекс включает в себя тщательно подобранный набор серверного программного обеспечения, а также невероятно удобную и продуманную управляющую утилиту, которая обладает мощными возможностями по администрированию и настройке всех доступных компонентов.

      Open Server Panel <u>не может работать с html</u> документами,
      Но <u>с php прекрасно справляется.</u>

      <p><b>Разница между PHP и HTML</b></p>
      <br><b>HTML</b>-<u>это язык разметки на стороне клиента,</u> который управляет внешним видом и ощущениями страницы. PHP-это серверный язык программирования, который управляет такими язками как: <u>HTML,</u> <u>JavaScript</u> и <u>CSS</u>, отправляемыми в браузер.
    </div>
  </div>
</div>
<?php get_sidebar('left');?>
	<div class="content">ТЕЛО</div>
<link href="https://cdn.jsdelivr.net/npm/bootstrap@5.1.3/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-1BmE4kWBq78iYhFldvKuhfTAU6auU8tT94WrHftjDbrCEXSU1oBoqyl2QvZ6jIW3" crossorigin="anonymous">
<?php get_sidebar('right');?>
