<div class="container">
  <div class="row">
<div class="UL">
                                            <h2>Юля</h2>
      Сайт – это информационная единица в интернете, ресурс из веб-страниц (документов), которые объединены общей темой и связаны между друг с другом с помощью ссылок. Он зарегистрирован на одно юридическое или физическое лицо и обязательно привязан к конкретному домену, являющемуся его адресом. Сайт может состоять как из одной страницы, так и огромного количества. Каждая страница ресурса – это текстовый файл или их набор, написанный на специальном языке разметки или программирования (HTML, PHP, CSS и пр.). После загрузки на компьютер файлы этого формата обрабатываются в браузере. В конечном итоге пользователь видит загруженную страницу сайта. 
      Виды сайтов
      Создание всех ресурсов направлено на достижение какой-либо определенной цели. Сайты бывают коммерческими, некоммерческими и информационными. 
      Некоммерческие. В эту группу входят социальные и правительственные ресурсы, площадки учебных учреждений или определенных лиц. Как правило, главная цель создания таких ресурсов – своевременно донести информацию до населения. Второстепенная – получение обратной связи.
      Коммерческие. Это веб-ресурсы компаний, созданные с целью увеличения клиентской базы, повышения продаж (некоторые организации специально создают площадки для оказания своих услуг или продажи товаров онлайн). Это промосайты, интернет-магазины, сайты-витрины, визитки и пр.
      Информационные. Это проекты, созданные для предоставления пользователям интересующей их информации. Как правило, это новостные сайты, блоги, тематические ресурсы. Для них характерна широкая целевая аудитория, доступная пользователям и максимально полная информация.
      Кто участвует в разработке сайта
      Сайт в интернете напоминает пазл. В его создании принимает участие множество специалистов. Его собирают верстальщики, программисты, интернет-маркетологи, дизайнеры.
      Веб-дизайнер. В первую очередь этот специалист разрабатывает дизайн будущего ресурса. Кроме желаний заказчика, он должен учитывать цель создания сайта, его аудиторию. Также специалист выполняет подбор подходящих шрифтов, определяет расположение изображений, видео и других медиафайлов. Таким образом создается макет.
      Верстальщик. Затем начинается работа верстальщика. С учетом уже готового дизайн-проекта он должен «подстроить» будущий ресурс под разные браузеры. Этот называется верстка макета.
      Программист. После этого программист занимается формированием структуры сайта и созданием системы управления проектом. Информация добавляется на ресурс только по окончании всех работ.
      Иные специалисты. Также в разработке ресурса принимает участие команда специалистов, которая занимается его раскруткой и усовершенствованием деятельности. В этом процессе может принимать участие как один человек, так и команда, состоящая из веб-аналитиков, копирайтеров, маркетологов и пр.
    </div> 
    <div class="SS1">
                                                    <h2>Сергей1</h2>
      Из чего состоит сайт
      Доменное имя – адрес веб-сайта, например seonews.ru. В данном случае это то, что отделено точкой от домена ru. Также существуют домены третьего, четвертого и других уровней. Для SEO наиболее эффективным считается доменное имя второго уровня.

      Сервер, или хостинг, – место, где размещены файлы вашего ресурса. Они хранятся не в облаках, а находятся физически на каком-либо устройстве, на котором предоставляет место хостинг.

      СMS – система управления большинством современных web-сайтов, их движок. Предназначен для удобства использования ресурса. Наиболее популярны WordPress, OpenCart, PrestaShop, Drupal, Joomla и др. Все их файлы находятся на конкретном сервере. Также там хранятся и файлы сайта – база данных, различные картинки, видео.

      Контент – содержимое веб-ресурса, то есть текст, изображения, видео, анимация и другие файлы. Оптимизация контента – важный этап продвижения сайта в Сети.
      Из чего состоит сайт, или основные структурные блоки сайта
      Шапка или хедер. Располагается всегда в самом верху страницы. Обычно в этом блоке размещается название сайта, или же, например, компании. В шапке могут разместить логотип (если он есть) и основное меню сайта.
      Контент. Основная область сайта. Здесь содержится вся основная информация, представленная на нем. Для информационных сайтов — это текст статей, для корпоративных — описание деятельности, услуг, товаров. Т. е. в этом блоке размещается вся информация, ради которой и создавался сайт.

      Подвал или футер. Это завершающий блок, который всегда располагается в самом низу страницы. Непременное место для информации о копирайте сайта. Здесь частенько размещают контактные данные для связи, что вполне удобно, т. к. футер на всех страницах сайта обычно одинаковый, да и контактную информацию долго искать не надо — всегда на глазах. Иногда в этом блоке дублируют часть основного меню сайта, чтобы не перелистывать страницу на самый верх (для удобства).

      Сайдбар. Он бывает левый и правый. Сайдбары присутствуют не на всех сайтах. Они могут быть размещены вместе по обе стороны от контента, но чаще используют один — левый или правый. Сайдбар — очень удобное место для второго меню на сайте. Основное — в шапке, а здесь — вспомогательное. Например, на информационных сайтах в сайдбаре размещают меню рубрик или содержание текущей статьи. Иногда сайдбар «прилепляют» на экране, и при прокрутке он всегда остается доступным, позволяя осуществлять более быструю и удобную навигацию.

    </div>
    <div class="tmk">
                                                          <h2>ТОМИОКА</h2>
      HTML (от английского HyperText Markup Language) - это код, который используется для структурирования и отображения веб-страницы и её контента. Например, контент может быть структурирован внутри множества параграфов, маркированных списков или с использованием изображений и таблиц данных. Но прежде всего HTML - это система верстки, которая определяет, как и какие элементы должны располагаться на веб-странице. Информация на сайте, способ её представления и оформления зависят исключительно от разработчика и тех целей, которые он перед собой ставит.

      Когда вы заходите на сайт, браузер подгружает НТМL-файл с информацией о структуре и контенте веб-страницы. HTML как бы выстраивает визуальный фундамент сайта, но не «запускает» сайт самостоятельно. Он всего лишь указывает, где располагаются элементы, какой у них будет базовый дизайн, откуда брать стили для элементов и скрипты.
      Основные элементы НТМL

      Раскрыть, что такое язык разметки HTML можно, представив его в качестве инструмента для преобразования простых команд (тегов), в визуальные объекты. К примеру, тег <img> применяется для вывода в браузере картинок. Обязательным атрибутом выступает ссылка на файл. Как правило, для хранения картинок используются ресурсы удаленного сервера, где расположены все файлы сайта, или специальные внешние сервисы.

      Основные группы элементов HTML используются для решения следующих задач:
      Текстовое форматирование - жирный шрифт, курсив, подчеркивание, размер кегля, списки (нумерованные или маркированные).

      Текстовые блоки - разные уровни заголовков от н1 до н6, абзацы, написание с новой строки

      Табличные формы - неограниченное число строчек, столбцов, указание до фиксированных параметров высоты/ширины, заголовки.

      Вставка картинок, аудио, текстовых и видеофайлов.

      Гиперссылки, обеспечивающие переход на файл картинки, прайса и на отдельную страницу с определенного пункта меню или анкора в тексте.

      Кроме того, существуют атрибуты, обеспечивающие открытия документа в текущем/новом окне. В языке HTML есть возможность для разработки простых форм для ввода текста, выбора пункта из списка.
      Если что-то не так, скажите, я подправлю

    </div>
    <div class="SS2">
                                                      <H2>Серге2</H2>
      Open Server Panel — это портативная программная среда, созданная специально для веб-разработчиков с учётом их рекомендаций и пожеланий.

      Данный программный комплекс включает в себя тщательно подобранный набор серверного программного обеспечения, а также невероятно удобную и продуманную управляющую утилиту, которая обладает мощными возможностями по администрированию и настройке всех доступных компонентов.

      Open Server Panel не может работать с html документами
      Но с php прекрасно.

      Разница между PHP и HTML очень проста. HTML-это язык разметки на стороне клиента, который управляет внешним видом и ощущениями страницы. PHP-это серверный язык программирования, который управляет HTML, JavaScript и CSS, отправляемыми в браузер.
    </div>
  </div>
</div>
<?php get_sidebar('left');?>
	<div class="content">ТЕЛО</div>
<link href="https://cdn.jsdelivr.net/npm/bootstrap@5.1.3/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-1BmE4kWBq78iYhFldvKuhfTAU6auU8tT94WrHftjDbrCEXSU1oBoqyl2QvZ6jIW3" crossorigin="anonymous">
<?php get_sidebar('right');?>
